---
kind: other
id: Properties.T:Autodesk.Revit.DB.CurveArrayIterator
source: html/9b27b141-6670-cac6-8a85-0347da02b41e.htm
---
# CurveArrayIterator Properties

Retrieves the item that is the current focus of the iterator.